In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv("titles.csv")
df.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [2]:
df1 = pd.read_csv("cast.csv")
df1.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [22]:
def get_decade(year):
    return int(year/10)*10

In [31]:
df1['decade']=df1['year'].apply(get_decade)

In [26]:
df1.groupby(['decade']).size()

decade
1890.0        3
1900.0       39
1910.0     6799
1920.0     9034
1930.0    10388
1940.0     8718
1950.0    12934
1960.0    17976
1970.0    19526
1980.0    21034
1990.0    22992
2000.0    39452
2010.0    75733
2020.0      285
2110.0        1
dtype: int64

In [27]:
df2=df1[df1['title']=='Hamlet']
df2.groupby(['decade']).size()

decade
1910.0    1
1920.0    1
1930.0    2
1960.0    2
1970.0    3
1980.0    2
1990.0    3
2000.0    3
2010.0    8
dtype: int64

In [37]:
df2=df1[df1['year'].between(1950,1959)]
df3=df2[df2['n']==1]
df4=df3.groupby(['type','year']).size()
df4

type     year
actor    1950    625
         1951    651
         1952    613
         1953    664
         1954    636
         1955    648
         1956    668
         1957    739
         1958    715
         1959    733
         1960    733
actress  1950    288
         1951    285
         1952    304
         1953    312
         1954    316
         1955    285
         1956    307
         1957    315
         1958    301
         1959    327
         1960    302
dtype: int64

In [42]:
df2=df1[df1['year'].between(1950,1959)]
df3=df2[df1['n'].between(1,5)]
df4=df3.groupby(['n','type','year']).size()
df4

C:\Users\ancil\AppData\Local\Temp\ipykernel_36416\225855181.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3=df2[df1['n'].between(1,5)]

n    type     year
1.0  actor    1950    625
              1951    651
              1952    613
              1953    664
              1954    636
                     ...
5.0  actress  1955    259
              1956    262
              1957    288
              1958    275
              1959    275
Length: 100, dtype: int64

In [50]:
df2=df1[df1["title"].str.contains('Pink Panther')]
df3=df2.groupby(['title']).size()
df3

title
Curse of the Pink Panther          67
Revenge of the Pink Panther        68
Son of the Pink Panther            46
The Pink Panther                  111
The Pink Panther 2                 84
The Pink Panther Strikes Again     70
The Return of the Pink Panther     30
Trail of the Pink Panther          41
dtype: int64

In [15]:
df2=df1[df1["name"]=='Frank Oz']
df3=df2.sort_values(by=['year'])
(df3.groupby(['title']).size()).where(df3.groupby(['title']).size()>1)

title
An American Werewolf in London                    2.0
Blues Brothers 2000                               NaN
Follow That Bird                                  3.0
Innocent Blood                                    NaN
Inside Out                                        NaN
Labyrinth                                         NaN
Monsters, Inc.                                    NaN
Muppet Treasure Island                            4.0
Muppets from Space                                4.0
Sesame Street: C is for Cookie Monster            NaN
Spies Like Us                                     NaN
Star Wars: Episode I - The Phantom Menace         NaN
Star Wars: Episode II - Attack of the Clones      NaN
Star Wars: Episode III - Revenge of the Sith      NaN
Star Wars: Episode V - The Empire Strikes Back    NaN
Star Wars: Episode VI - Return of the Jedi        NaN
Star Wars: Episode VII - The Force Awakens        NaN
Superman III                                      NaN
The Adventures of Elmo in Grouchland              3.0
The Blues Brothers                                NaN
The Dark Crystal                                  2.0
The Great Gilly Hopkins                           NaN
The Great Muppet Caper                            6.0
The Muppet Christmas Carol                        7.0
The Muppet Movie                                  8.0
The Muppets Take Manhattan                        7.0
Trading Places                                    NaN
Zathura: A Space Adventure                        NaN
dtype: float64

In [11]:
df2=df1[df1["name"]=='Frank Oz'].where (df1['n']>1)
df2

,title,year,name,type,character,n
1723598,An American Werewolf in London,1981.0,Frank Oz,actor,Mr. Collins,13.0
1723599,An American Werewolf in London,1981.0,Frank Oz,actor,Miss Piggy,13.0
1723600,Blues Brothers 2000,1998.0,Frank Oz,actor,Warden,4.0
1723601,Follow That Bird,1985.0,Frank Oz,actor,Cookie Monster,3.0
1723602,Follow That Bird,1985.0,Frank Oz,actor,Bert,3.0
...,...,...,...,...,...,...
1723657,The Muppets Take Manhattan,1984.0,Frank Oz,actor,Cookie Monster,2.0
1723658,The Muppets Take Manhattan,1984.0,Frank Oz,actor,Ocean Breeze Soap Board Member,2.0
1723659,The Muppets Take Manhattan,1984.0,Frank Oz,actor,Sam the Eagle,2.0
1723660,Trading Places,1983.0,Frank Oz,actor,Corrupt Cop,46.0
1723661,Zathura: A Space Adventure,2005.0,Frank Oz,actor,Robot,6.0